code-review/NRB_3471_3546/База_Было/InformationRegisters/ФормыСообщенийКабинетаКлиентаВТБКБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФормыСообщенийКабинетаКлиентаВТБКБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормаСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСообщенийКК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУведомления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБНеПодпадающаяПодНалоговоеРегулированиеСША</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ФормыСообщенийКабинетаКлиентаВТБКБ/Ext/ManagerModule.bsl
Функция ФормаСообщения(ВидКД, Этап, ТипУведомления, ЦБНеПодпадающаяПодНалоговоеРегулированиеСША) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормыСообщений.ФормаСообщения КАК ФормаСообщения
	|ИЗ
	|	РегистрСведений.ФормыСообщенийКабинетаКлиентаВТБКБ КАК ФормыСообщений
	|ГДЕ
	|	ФормыСообщений.ВидКД = &ВидКД
	|	И (ФормыСообщений.Этап = &Этап ИЛИ ФормыСообщений.Этап = &ПустойЭтап)
	|	И (ФормыСообщений.ТипУведомления = &ТипУведомления ИЛИ ФормыСообщений.ТипУведомления = &ПустойТипУведомления)
	|	И (ФормыСообщений.ВидКД.Код <> &КодПодтвержденияОсвобожденияОтНалогов 
	|		ИЛИ ФормыСообщений.ЦБНеПодпадающаяПодНалоговоеРегулированиеСША = &ЦБНеПодпадающаяПодНалоговоеРегулированиеСША)
	|УПОРЯДОЧИТЬ ПО
	|	ФормыСообщений.Этап,
	|	ФормыСообщений.ТипУведомления
	|");
	Запрос.УстановитьПараметр("ВидКД", ВидКД);
	Запрос.УстановитьПараметр("Этап", Этап);
	Запрос.УстановитьПараметр("ПустойЭтап", Справочники.ЭтапыКД.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипУведомления", ТипУведомления);
	Запрос.УстановитьПараметр("ПустойТипУведомления", Справочники.ТипыУведомления.ПустаяСсылка());	
	Запрос.УстановитьПараметр("КодПодтвержденияОсвобожденияОтНалогов", "WTRC");
	Запрос.УстановитьПараметр("ЦБНеПодпадающаяПодНалоговоеРегулированиеСША", ЦБНеПодпадающаяПодНалоговоеРегулированиеСША);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();		
		Возврат Выборка.ФормаСообщения;
	КонецЕсли;
КонецФункции
